app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("title", "start_time", "trainer_id", "created_at", "updated_at", "course_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["start_time", "2019-04-01 23:43:00"], ["trainer_id", 1], ["created_at", "2019-04-01 23:43:53.432755"], ["updated_at", "2019-04-01 23:43:53.432755"], ["course_id", 1]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save

UPDATE "schedules" SET "trainer_id" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["trainer_id", 1], ["updated_at", "2019-04-04 01:05:56.606486"], ["id", 19]]
---
  def update
    respond_to do |format|
      if @schedule.update(schedule_params)

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 6]]
---
  def destroy
    @schedule.destroy